<?php

return [
    ///////////////////////////////////////////////
    'general'    => [
        'unknown' => 'Неизвестный',
        'search'  => 'Поиск',
        'back'    => 'Назад',
        'CRUD'    => [
            'create' => 'Создать',
            'delete' => 'Удалить',
            'edit'   => 'Редактировать',
            'view'   => 'Показать',
        ],
        'forms'   => [
            'submit'         => 'Отправить',
            'choose file'    => 'Выберите файл',
            'confirm'        => 'Вы уверены?',
            'yes'            => 'Да',
            'select all'     => 'Выбрать все',
            'unselect all'   => 'Снять все',
            'select year'    => 'Выберите год',
            'select brand'   => 'Выберите марку',
            'select country' => 'Выберите страну',
            'actions'        => 'Действия',
            'of'             => 'Из',
            'cancel'         => 'Отмена',
        ],
        'result'  => [
            'success' => 'Успешно',
            'error'   => 'Ошибка',
            'update'  => 'Обновлено',
        ],
    ],
    ///////////////////////////////////////////////
    'statistics' => [
        'about car' => 'О машине',
    ],
    ///////////////////////////////////////////////
    'cars'       => [
        'cars'         => 'Машины',
        'car'          => 'Машина',
        'all cars'     => 'Все машины',
        'connected'    => 'Подключенные',
        'disconnected' => 'Отключенные',
        'table'        => [
            'image'       => 'Изображение',
            'name'        => 'Имя',
            'brand_name'  => 'Марка',
            'year'        => 'Год',
            'vin_number'  => 'VIN код',
            'gov_number'  => 'Номер автомобиля',
            'location'    => 'Локация',
            'description' => 'Описание',
            'color'       => 'Цвет',
            'api_key'     => 'API код',
        ],
        'result'       => [
            'create' => 'Транспорт создан',
            'delete' => 'Транспорт удален',
        ],
    ],
    'company'    => [
        'register company' => 'Регистрация компании',
    ],
    ///////////////////////////////////////////////
    'navigation' => [
        'main' => 'Главная',
        'cars' => 'Машины',
    ],
    ///////////////////////////////////////////////
    'map'        => [
        'routes'          => 'Маршруты',
        'start route'     => 'Начало маршрута',
        'end route'       => 'Конец маршрута',
        'km'              => 'км',
        'current route'   => 'Текущий',
        'time on the way' => 'Время в пути',
    ],
    ///////////////////////////////////////////////
];
